{
  "block.hexparty.impetus.socket": "Wandering Impetus",

  "hexparty.iota.response": "HTTPResponse{%s}",

  "hexparty.mishap.invalid_json_key": "The \"%s\" key is not present within the JsonIota!",
  "hexparty.mishap.cannot_json": "The %s iota has no direct Json translation!",
  "hexparty.mishap.too_early": "You tried accessing a HTTP response before it arrived!",
  "hexparty.mishap.filtered_url": "The url %s is filtered.",
  "hexparty.mishap.packet_too_big": "The data you attempted to send is too big! Size of %s bytes is bigger than 65535 bytes!",
  "hexparty.mishap.no_socket": "The Socket with ID %s does not exist!",
  "hexcasting.mishap.invalid_value.class.json": "a json object",
  "hexcasting.mishap.invalid_value.class.response": "a HTTP response",
  "hexcasting.mishap.invalid_value.class.method": "a string value matching any HTTP request method except CONNECT (GET, FETCH, POST, etc)",
  "hexcasting.mishap.invalid_value.class.headers.list": "a list of key-value string pairs ([key, value, key,...])",
  "hexcasting.mishap.invalid_value.class.headers.json": "a json with only string values",
  "hexcasting.mishap.invalid_value.class.headers": "a list of key-value string pairs or json with only string values",
  "hexcasting.mishap.invalid_value.class.body": "a string or json",
  "hexparty.mishap.translatable": "Expected a json object that has a value key which holds a JsonArray.",

  "hexparty.entry.json_patterns": "JSON Patterns",
  "hexparty.page.json_patterns.entry": "These patterns were taken from a series of notes scrawled on the walls of the room of a Douglas Crockford shortly before their disappearence.$(br)$(br)They describe ways of creating and manipulating a dictionary-like object which uses Strings for keys and a select range of iotas as values. I wonder what the practical applications are...",
  "hexcasting.action.hexparty:create_json": "Jason's Reflection",
  "hexparty.page.json_patterns.create_json": "Creates an empty JSON object.",
  "hexcasting.action.hexparty:parse_json": "Jason's Gambit",
  "hexparty.page.json_patterns.parse_json": "Turns the given String into a JSON object. If it cannot be parsed into a JSON object itself, a wrapper JSON object will be created.",
  "hexcasting.action.hexparty:has_element": "Jason's Distillation",
  "hexparty.page.json_patterns.has_element": "Checks whether the given JSON iota has the given key.",
  "hexcasting.action.hexparty:get_element": "Jason's Purification",
  "hexparty.page.json_patterns.get_element": "Gets the stored iota at the given key. Mishaps upon their being no iota.",
  "hexcasting.action.hexparty:set_element": "Jason's Exaltation",
  "hexparty.page.json_patterns.set_element": "Sets the given iota at the given key. Setting a Garbage iota removes the key.",
  "hexcasting.action.hexparty:json_to_pattern_list": "Jayden's Purification",
  "hexparty.page.json.patterns.json_to_pattern_list": "Turns the given JSON iota into a list of iotas. The note beneath says it uses ducky peripherals' iota mappings, whatever that means.",
  "hexcasting.action.hexparty:json_from_pattern_list": "Jayden's Purification II",
  "hexparty.page.json.patterns.json_from_pattern_list": "Turns the given list into JSON. Like its sister pattern, it uses ducky peripherals' iota mappings.",

  "hexparty.entry.http_spells": "HTTP Spells",
  "hexparty.page.http_spells.entry": "While pondering the depths of one's mind, Sir Bernes-Lee caught a glimpse into another universe. With this view fresh in his mind, he quickly conjured a JSON object, imbued it with information, and sent it hurdling into the other universe.$(br)These are the patterns recovered after Berners-Lee was found dead having received enough information back to fry his mind.",
  "hexparty.page.http_spells.explanation": "To use the following pattern, one needs a $(thing)URL$() as a string alone.$(br)Optionally, one may also include a $(thing)HTTP method$() as a string (defaults to GET if omitted), $(thing)headers$() as either a list of key-value string pairs ([key, value,...]) or a JSON object with string values, and a $(thing)body$() as either a JSON or a string.$(br2)Supported $(thing)HTTP Methods$():$(li)GET$(li)POST$(li)PUT$(li)DELETE$(li)HEAD$(li)OPTIONS$(li)PATCH$(li)TRACE",
  "hexcasting.action.hexparty:request": "Request",
  "hexparty.page.http_spells.request": "$(br)Sends an HTTP request to the given $(thing)URL$(). Optionally, the $(thing)method$() used, $(thing)headers$() attached, and the $(thing)body$() of data sent with it may also be specified. Returns a $(thing)Response$() which will be Truthy when the response is received.",
  "hexcasting.action.hexparty:get_response": "Get Response",
  "hexparty.page.http_spells.get_response": "Given a Response from an HTTP request, attempt to parse the results. Will Mishap if too early or an error is thrown.",
  "hexcasting.action.hexparty:get_copyparty": "Get Copyparty",
  "hexparty.page.http_spells.get_copyparty": "Given a path and a password, attempts to make a request to the hexparty path given. You *can* do this with the request pattern, but it is significantly easier to do it this way.",
  "hexcasting.action.hexparty:set_copyparty": "Set Copyparty",
  "hexparty.page.http_spells.set_copyparty": "\nGiven a path, iotas, and password, attempts to set the file at that hexparty path to the given iotas. You *can* do this with the Request pattern, but it is significantly better to do it this way.",
  "hexcasting.action.hexparty:response_json": "Get Response II",
  "hexparty.page.http_spells.response_json": "\nIf the given boolean is true, turns the response's body into a pattern list, using json as an intermediary. If false, then turns the body of the response into json directly.",

  "hexparty.entry.socket_patterns": "Socket Patterns",
  "hexparty.page.socket_patterns.entry": "With the Enlightened Mind, I can perceive beyond our reality and call upon faint connections to others. With the following device and patterns, I can focus this perception and gather information from these other realities.",
  "hexparty.page.brainsweeping.impetus_socket": "This device, the Wandering Impetus, will allow me to narrow down and focus this new perception, allowing the transfer of information between realities!",
  "hexparty.page.socket_patterns.usage": "To utilize the Wandering Impetus, once must place it as part of a Spell Circle. Then, use the Establish Spell to establish a socket connection. Once that is done, the Impetus is ready.$(br)$(br)Upon the Socket receiving data, the Impetus will trigger the tick after, providing the Wave with the received data as a list of strings.",
  "hexcasting.action.hexparty:read": "Cerf's Reflection",
  "hexparty.page.socket_patterns.read": "Utilizing the Wandering Impetus used to trigger the Spell Circle, I can attempt to poll the received data queue and, upon success, receive a string iota. Failure returns a null iota.",
  "hexcasting.action.hexparty:get_host": "Kahn's Reflection",
  "hexparty.page.socket_patterns.get_host": "Given the position for a Wandering Impetus, attempts to retrieve the Socket's host as a string iota. Failure or absence returns a null iota.",
  "hexcasting.action.hexparty:get_port": "Kahn's Reflection II",
  "hexparty.page.socket_patterns.get_port": "Given the position for a Wandering Impetus, it will retrieve the Socket's port as a double iota.",

  "hexparty.entry.socket_spells": "Socket Spells",
  "hexparty.page.socket_spells.entry": "I must be mad. I have further augmented the device to allow for sending information to those other realities. SOme even whisper back in cyphers I may yet understand...",
  "hexcasting.action.hexparty:send": "Send",
  "hexparty.page.socket_spells.send": "Utilizing the Socket Impetus used to trigger the Spell Circle, this sends the provided data through the Socket's connection.",
  "hexcasting.action.hexparty:set": "Establish",
  "hexparty.page.socket_spells.set": "Given the position for a Socket Impetus, attempts to establish a new Socket connection."
}